{
  "architectures": [
    "LlavaForConditionalGeneration"
  ],
  "image_seq_length": 1,
  "image_token_id": 10,
  "image_token_index": 10,
  "model_type": "llava",
  "multimodal_projector_bias": false,
  "projector_hidden_act": "gelu",
  "text_config": {
    "attention_dropout": 0.0,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 256,
    "initializer_range": 0.02,
    "intermediate_size": 256,
    "max_position_embeddings": 131072,
    "model_type": "mistral",
    "norm_eps": 1e-05,
    "num_attention_heads": 96,
    "num_hidden_layers": 4,
    "num_key_value_heads": 8,
    "rms_norm_eps": 1e-05,
    "rope_theta": 1000000000.0,
    "sliding_window": null,
    "use_cache": true,
    "vocab_size": 32768
  },
  "torch_dtype": "bfloat16",
  "transformers_version": "4.51.3",
  "vision_config": {
    "attention_dropout": 0.0,
    "head_dim": 88,
    "hidden_act": "silu",
    "hidden_size": 256,
    "image_break_token_id": 14,
    "image_end_token_id": 15,
    "image_size": 1024,
    "image_token_id": 10,
    "initializer_range": 0.02,
    "intermediate_size": 256,
    "model_type": "pixtral",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 4,
    "patch_size": 16,
    "rope_theta": 10000.0
  },
  "vision_feature_layer": -1,
  "vision_feature_select_strategy": "full"
}
